print("I. Функция с параметрами по умолчанию:")
def print_params(a = 1, b = "строка", c = True):
    print(a, b, c)
print("_________________________________________________________________________________________________________")
print("1-ое - вызов без аргументов")
print_params()
print("_________________________________________________________________________________________________________")
print("2-ое - переопределение параметров. Вызов позиционно")
print_params(1, 2, 3)
print("_________________________________________________________________________________________________________")
print("3-ье -переопределение параметра b")
print_params(b = 25)
print("_________________________________________________________________________________________________________")
print("4-ое - переопределение параметра С")
print_params(c = [1,2,3])
print("_________________________________________________________________________________________________________")
print("II. Распаковка параметров:")
# Создаем список значений
values_list = [11, "Список", True]
# Создаем словарь с тремя ключами и значениями разных типов
values_dict = {
    "a": 123,
    "b": "Словарь",
    "c": False
}
print("Передаем значения из словаря в функцию print_params с помощью распаковки")
print_params(**values_dict)
print("Передаем значения из списка в функцию print_params с помощью распаковки")
print_params(*values_list)

print("_________________________________________________________________________________________________________")
print("III. Распаковка + отдельные параметры:")
# Создаем список значений values_list_2
values_list_2 = [32, "Список2"]
print_params(*values_list_2, 42)
print("список values_list_2 с двумя элементами разных типов работает print_params(*values_list_2, 42)")
